/*
 * JSON数据
 */

//彩种描述
var lotDesc = {
    "ssc":"中奖率高 玩法多样",
    "ffc":"高频彩种 好玩易中",
    "mmc":"想开就开 无需等待",
    "115":"玩法简单 返奖率高",
    "3d":"灵活简单 经济实惠",
    "p3":"公益体彩 精彩纷呈",
    "pk10":"赛车主题 无限乐趣"
}

var lotSSC = {
	"normal":{
		"label":{
			"nums":[0,1,2,3,4,5,6,7,8,9],
			"hz_nums":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27],
			"zxhz_nums":[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26],
			"x2hz_nums":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18],
			"x2zxhz_nums":[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17],
			"dxds_nums":["大","小","单","双"],
			"dx_nums":["大","小"],
			"ds_nums":["单","双"],
		    "lhh_nums":["龙","虎","和"],
		    "nn_nums":["一","二","三","四","五","六","七","八","九","牛"],
		    "mn_nums":["没"],
			"zhixuan":["万位","千位","百位","十位","个位"],
			"zhixuanQ4":["万位","千位","百位","十位"],
			"zhixuanH4":["千位","百位","十位","个位"],
			"zhixuanQ3":["万位","千位","百位"],
			"zhixuanZ3":["千位","百位","十位"],
			"zhixuanH3":["百位","十位","个位"],
			"zhixuanQ2":["万位","千位"],
			"zhixuanH2":["十位","个位"],
			"zhixuanZ2":["百位","十位"],
			"zuxuan":["组选"],
			"zuxuan60":["二重号","单号"],
			"zuxuan30":["三重号","单号"],
			"zuxuan10":["三重号","二重号"],
			"zuxuan5":["四重号","单号"],
			"zhixuanHZ":["和值"],
			"z3":["组三"],
			"z6":["组六"],
			"bdd":["不定胆"],
			"dwd":["定位胆"],
			"qw":["趣味"],
			"lhh":["龙虎和"],
			"niu":["牛"]
		}
	}
}

var lot115 = {
	"normal":{
		"label":{
			"nums":['01','02','03','04','05','06','07','08','09','10','11'],
			"zhixuanQ3":["万位","千位","百位"],
			"zhixuanZ3":["千位","百位","十位"],
			"zhixuanH3":["百位","十位","个位"],
			"zhixuanQ2":["万位","千位"],
			"zhixuanH2":["十位","个位"],
			"zhixuanQ1":["万位"],
			"2z2":["二中二"],
			"3z3":["三中三"],
			"4z4":["四中四"],
			"5z5":["五中五"],
			"6z5":["六中五"],
			"7z5":["七中五"],
			"8z5":["八中五"],
			"dwd":["第一位","第二位","第三位"],
			"bdd":["不定胆"],
			"zuxuan":["组选"]
		}
	}
}

var PK10 = {
	"normal":{
		"label":{
			"nums":['01','02','03','04','05','06','07','08','09','10'],
			"hz_nums":[3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],
			"dx_nums":["大","小"],
			"ds_nums":["单","双"],
			"lh_nums":["龙","虎"],
			"guan":["冠军"],
			"guanya":["冠军","亚军"],
			"q3":["冠军","亚军","季军"],
			"c15":["第一名","第二名","第三名","第四名","第五名"],
			"c610":["第六名","第七名","第八名","第九名","第十名"],
			"d1":["第一名"],
			"d2":["第二名"],
			"d3":["第三名"],
			"1v10":["1v10"],
			"2v9":["2v9"],
			"3v8":["3v8"],
			"4v7":["4v7"],
			"5v6":["5v6"],
			"hz":["和值"]
		}
	}
}

var xySSC = {
	"normal":{
		"label":{
			"9.8":[9.8],
			"1.96":[1.96],
			"2.178":[2.178],
			"2.744":[2.744],
			"15.027":[15.027],
			"3.005":[3.005],
			"97.999":[97.999],
			"16.333":[16.333],
			"3.626":[3.626],
			"2.722":[2.722],
			"3.267":[3.267],
			"3.626":[3.626],
			"2.722":[2.722],
			"9799.920":[9799.920],
			"217.776":[217.776],
			"13.611":[13.611],
			"9.038":[9.038],
			"1.938":[1.938],
			"108.888":[108.888],
			"90.704":[90.704],
			"3.234":[3.234]
		}
	}
}
